{
    
    "homePage" : {     
        "wellcome" : "سلام! به سایت شخصی من خوش آمدید",
        "job" : "  توسعه دهنده وب",
        "name" : "امیرمحمد",
        "lastName" : "زنگی آبادی",
        "desc" : "من یک  توسعه دهنده فرانت اند در کرمان هستم",
        "profile" : "پروفایل",
        "credential" : "مهارت ها",
        "project" : "نمونه کارها",
        "tprofile" : "با من بمون",
        "tcredential" : "بیشتر در مورد من",
        "tproject" : "ویترین",
        "itemPOne" : "مشتریان",
        "itemPTwo" : "در ایران",
        "itemYOne" : "سال",
        "itemYTwo" : "تجربه",
        "itemWOne" : "تمام ",
        "itemWTwo" : "نمونه کارها"
     },
     "aboutPage" : {
        "title" : "خلاصه ای از من",
        "name" : "امیرمحمد زنگی آبادی ",
        "desc" : "اینجانب امیرمحمد زنگی آبادی هستم، برنامه نویس و علاقه مند به توسعه صفحات وب، تخصصم در زمینه تحلیل، طراحی و پیاده سازی برنامه های تحت وب می باشد. برای من کیفیت در کنار سرعت مهم است."
    },
    "credentialPage":{
        "name" :"امیرمحمد زنگی آبادی ",
            "title" : "درباره من ",
            "descOne" : "اینجانب امیرمحمد زنگی آبادی هستم، برنامه نویس و علاقه مند به توسعه صفحات وب، تخصصم در زمینه تحلیل، طراحی و پیاده سازی برنامه های تحت وب می باشد. برای من کیفیت در کنار سرعت مهم است.",
            "descTwo" : "من به کار گروهی علاقه مند هستم زیرا به من امکان می دهد در آن شرکت کنم و با دیگران تبادل نظر کنم. همچنین می توانم تجربیاتم را با دیگران به اشتراک بگذارم و از تجربیات آنها بهره ببرم. کار گروهی برای رسیدن به اهداف بهتر و موثرتر است و تیمی را ایجاد می کند که از یکدیگر حمایت می کنند. این به من احساس رضایت و ارتباط اجتماعی قوی تری می دهد.",
            "descThree" : "آنچه برای من مهم است تعهد به انجام هر چه سریعتر کار و توانایی دستیابی به بهترین کیفیت است",
            "skills": "مهارت ها "
    },
    "contactPage" : {
        "mail" :"ایمیل من",
        "contact" :"شماره تماس من",
        "loc" :"موقعیت",
        "media" :"فضای مجازی",
        "city" : "کرمان ,ایران"
    },
    "worksPage":{
        "title" : "همه نمونه کارها",
        "github" : "گیت هاب",
        "live" : "نمایش",
        "details" : "توضیحات",
        "show" : "ویترین",
        "react" : "React یک کتابخانه محبوب جاوا اسکریپت برای ساخت رابط کاربری است. این به توسعه دهندگان اجازه می دهد تا اجزای تعاملی و قابل استفاده مجدد ایجاد کنند که می توانند به طور موثر و روان به روز شوند. React از یک DOM مجازی (مدل شیء سند) استفاده می‌کند تا تنها بخش‌هایی از UI را که نیاز به تغییر دارند، به‌روزرسانی مؤثری داشته باشد، و در نتیجه برنامه‌های کاربردی سریع‌تر و پاسخ‌دهنده‌تر می‌شوند. یکی از مفاهیم کلیدی در React معماری مبتنی بر کامپوننت است که در آن رابط کاربری به اجزای کوچک‌تر و قابل استفاده مجدد تقسیم می‌شود که می‌توانند برای ساخت رابط کاربری پیچیده با هم ترکیب شوند. این مؤلفه‌ها می‌توانند روش‌های حالت و چرخه حیات خاص خود را داشته باشند که مدیریت وضعیت و رفتار رابط‌های کاربری را آسان‌تر می‌کند. React همچنین یک سبک برنامه‌نویسی اعلانی را ترویج می‌کند، جایی که توسعه‌دهندگان به جای تعریف ضروری هر مرحله از به‌روزرسانی رابط‌های کاربری، توصیف می‌کنند که رابط کاربری باید بر اساس وضعیت فعلی آن چگونه باشد. این باعث می شود کد قابل پیش بینی تر و راحت تر در مورد آن استدلال شود. React به طور گسترده برای ساخت برنامه های تک صفحه ای و همچنین برنامه های تلفن همراه با استفاده از React Native استفاده می شود. دارای یک جامعه بزرگ و فعال است، با منابع و کتابخانه های زیادی در دسترس برای کمک به توسعه دهندگان در ساخت برنامه های کاربردی قوی و کارآمد.",
        "reactrouterdom" : "React Router Dom یک کتابخانه محبوب برای مدیریت مسیریابی در برنامه های React است. مجموعه‌ای از مؤلفه‌ها را فراهم می‌کند که به توسعه‌دهندگان اجازه می‌دهد مسیرهای مختلف را تعریف کنند و مؤلفه‌های مختلف را بر اساس URL فعلی ارائه دهند. با React Router Dom، توسعه‌دهندگان به راحتی می‌توانند اپلیکیشن‌های تک صفحه‌ای با چندین نمایش و پیمایش بین آن‌ها ایجاد کنند. همچنین ویژگی هایی مانند مسیریابی تودرتو، مسیریابی پویا و پارامترهای URL را ارائه می دهد که امکان ناوبری و مسیریابی پیشرفته تر را فراهم می کند. React Router Dom به طور گسترده استفاده می شود و به خوبی مستند شده است و آن را به یک انتخاب قابل اعتماد برای مدیریت مسیریابی در برنامه های React تبدیل می کند.",
        "materialui": "Mui یک کتابخانه محبوب برای ساخت رابط کاربری در React است. مجموعه ای از اجزای از پیش طراحی شده را ارائه می دهد که به راحتی می توان آن ها را سفارشی کرد و برای ایجاد رابط های کاربری زیبا و پاسخگو ایجاد کرد. Mui از دستورالعمل های طراحی متریال پیروی می کند و زیبایی طراحی مدرن و تمیزی را ارائه می دهد. همچنین شامل ویژگی‌هایی مانند طرح‌بندی‌های واکنش‌گرا، پشتیبانی دسترس‌پذیری و انیمیشن‌های روان است. با Mui، توسعه‌دهندگان می‌توانند به سرعت رابط‌های کاربری باکیفیت را برای برنامه‌های وب و موبایل ایجاد کنند",
        "graphql" : "GraphQL یک زبان پرس و جو و زمان اجرا برای API ها است که توسط فیس بوک توسعه داده شده است. در مقایسه با API های RESTful سنتی، رویکرد کارآمدتر و انعطاف پذیرتری برای واکشی و دستکاری داده ها ارائه می کند.",
        "hygraph" :"Hygraph یک فریم ورک باطن آماده برای ساخت و توسعه وب سایت ها و برنامه های کاربردی وب است. بر اساس GraphQL، ویژگی های قدرتمند GraphQL را برای ساده سازی و تسریع ایجاد و مدیریت خدمات وب شما ارائه می دهد. با Hygraph، می توانید به راحتی سیستم های باطن مقیاس پذیر، کارآمد و انعطاف پذیر برای وب سایت ها و برنامه های خود بسازید.",
        "redux" : "علاوه بر این، Redux به عنوان یک ابزار مدیریت دولتی استفاده شده است. Redux یک محفظه حالت قابل پیش بینی برای برنامه های جاوا اسکریپت است که به مدیریت وضعیت برنامه به روشی ساختاریافته تر و سازماندهی شده کمک می کند. این یک منبع واحد از حقیقت را فراهم می کند و ردیابی تغییرات و مدیریت وضعیت در اجزای مختلف را آسان تر می کند.",
        "axios" : "Axios یک کتابخانه محبوب جاوا اسکریپت است که برای ایجاد درخواست های HTTP از یک سرویس گیرنده وب به یک سرور استفاده می شود. این یک API ساده و شهودی برای ارسال درخواست‌های HTTP ناهمزمان و رسیدگی به پاسخ‌ها فراهم می‌کند. Axios را می توان با هر چارچوب یا کتابخانه جاوا اسکریپت از جمله Vue.js استفاده کرد و ویژگی هایی مانند تجزیه خودکار JSON، لغو درخواست و رهگیرهای پاسخ را ارائه می دهد که آن را به ابزاری قدرتمند برای مدیریت تماس های API در یک برنامه وب تبدیل می کند.",
        "nextjs" : "یک وب‌سایت تجارت الکترونیکی مبتنی بر Next.js از تکنیک‌های SSG (تولید سایت استاتیک)، SSR (رندر سمت سرور) و ISR (بازسازی استاتیک افزایشی) استفاده می‌کند.",
        "ssg" : "SSG به تولید صفحات ثابت در طول فرآیند ساخت وب سایت اشاره دارد. به این معنی که وقتی فرکانس به روز رسانی زیاد نباشد، صفحات به طور خودکار تولید و کش می شوند. در درخواست بعدی، سرور از نسخه کش صفحات استفاده می کند. این رویکرد عملکرد سریعتر و کارآمدتری را ارائه می دهد.",
        "ssr" : "از طرف دیگر SSR در هر درخواست HTML تولید می کند که به سرور اجازه می دهد کامپوننت های React را رندر کند و صفحه کاملاً رندر شده را برای مشتری ارسال کند. این تضمین می کند که محتوا همیشه به روز باشد.",
        "isr" : "در نهایت، ISR بهترین های SSG و SSR را به ارمغان می آورد. با ISR، می‌توانید بخش‌هایی از صفحه خود را به صورت ایستا تولید کنید و در عین حال یک بازه زمانی برای بازسازی آنها نیز مشخص کنید. این به شما امکان می دهد محتوای پویا در صفحات استاتیک خود داشته باشید و عملکرد و تازگی را تضمین کنید.",
        "pages" : "به طور کلی، ترکیب SSG، SSR و ISR در یک وب سایت تجارت الکترونیک Next.js به دستیابی به زمان بارگذاری سریع، سئوی بهتر و تجربه کاربری عالی کمک می کند. به روشی مشابه Next.js، MongoDB معمولاً با پشته MERN استفاده می شود. MongoDB یک پایگاه داده NoSQL است که به خوبی با جاوا اسکریپت کار می کند و برای ذخیره داده ها و اطلاعات تولید شده توسط وب سایت ها استفاده می شود.",
        "tailwind" : "علاوه بر آن از Tailwind CSS استفاده شده است. Tailwind CSS یک چارچوب CSS کاربردی است که با ارائه مجموعه ای از کلاس های CSS آماده برای استفاده، توسعه سریع را امکان پذیر می کند. این به توسعه دهندگان اجازه می دهد تا با استفاده از این کلاس ها به طور مستقیم در نشانه گذاری خود، اجزای UI را به سرعت و کارآمد بسازند. Tailwind CSS همچنین یک رویکرد بسیار قابل تنظیم را ترویج می کند، و توسعه دهندگان را قادر می سازد به راحتی طرح های منحصر به فرد را بدون نوشتن کد CSS سفارشی ایجاد کنند.",
        "tiptap" : "Tiptap یک چارچوب ویرایشگر متن غنی مدرن و قابل توسعه است که با Vue.js ساخته شده است. مجموعه ای از اجزای قابل تنظیم و قابل استفاده مجدد را برای ایجاد و ویرایش محتوای متن غنی ارائه می دهد. Tiptap از ویژگی‌های مختلفی مانند قالب‌بندی، جاسازی رسانه، و مدیریت ورودی کاربر پشتیبانی می‌کند، که آن را به انتخابی عالی برای اجرای یک قابلیت ویرایش متن غنی در یک برنامه تبدیل می‌کند.",
        "nextauth":"عبارتی که من استفاده کرده ام نشان می دهد که شما از یک ابزار یا تکنولوژی خاصی در این پروژه استفاده کرده اید. در این مورد خاص، NextAuth.js به عنوان ابزار مورد استفاده ذکر شده است. NextAuth.js یک کتابخانه توسعه وب مناسب برای توسعه است که ویژگی های احراز هویت با استفاده آسان را در برنامه های React و Next.js ارائه می دهد.",
        "lastestnext" : "آخرین نسخه Next.js 13.4.13 است که در 8 آگوست 2023 منتشر شد. این نسخه شامل تعدادی ویژگی و بهبودهای جدید است، از جمله: پشتیبانی داخلی SEO برای App Router. این کار اضافه کردن ابرداده سئو را به صفحات خود آسان می کند، مانند عنوان، توضیحات و برچسب های Open Graph. کنترل کننده های مسیر این به شما امکان می دهد منطق سفارشی را برای مدیریت مسیرها، مانند احراز هویت یا مجوز تعریف کنید. MDX برای اجزای سرور. این کار استفاده از MDX، یک فرمت محبوب برای ترکیب Markdown و React را در اجزای سرور شما آسان می کند. تجزیه کننده Rust MDX. این تجزیه کننده MDX سریعتر و کارآمدتری را برای Next.js فراهم می کند. همپوشانی خطا بهبود یافته است. پوشش خطا برای ارائه اطلاعات بیشتر در مورد خطاها، مانند ردیابی پشته و شماره خط که در آن خطا رخ داده است، بهبود یافته است. پیوندهای تایپ شده استاتیک (بتا). این به شما امکان می دهد پیوندها را به صورت ایستا در کد خود تایپ کنید، که می تواند به جلوگیری از خطاها کمک کند. بهبود توربوپک (آلفا). Turbopack یک موتور رندر جدید Next.jss است و این نسخه شامل تعدادی بهبود است، مانند عملکرد بهتر و پشتیبانی از واردات پویا. حافظه پنهان Next.js (بتا). این ویژگی جدید به شما امکان می دهد خروجی برنامه Next.js خود را در حافظه پنهان ذخیره کنید، که می تواند عملکرد را بهبود بخشد و استفاده از پهنای باند را کاهش دهد.",
        "generatemeta" : "تابعgeneMetadata در Next.js برای تعریف ابرداده پویا برای یک صفحه یا طرح بندی استفاده می شود. فراداده اطلاعاتی در مورد یک صفحه است که توسط موتورهای جستجو و سایر برنامه ها برای نمایه سازی و نمایش صفحه استفاده می شود. این می تواند شامل مواردی مانند عنوان، توضیحات، کلمات کلیدی و URL متعارف باشد.",
        "mongo" :"MongoDB یک سیستم مدیریت پایگاه داده سند محور (DBMS) است که از اسناد JSON مانند با طرحواره های پویا استفاده می کند. این باعث می شود آن را بسیار منعطف و مقیاس پذیر کند و یک انتخاب محبوب برای برنامه های کاربردی وب مدرن است. MongoDB داده ها را در مجموعه هایی ذخیره می کند که شبیه جداول در پایگاه داده های رابطه ای سنتی هستند. با این حال، اسناد موجود در مجموعه MongoDB می توانند طرحواره های مختلفی داشته باشند، به این معنی که نیازی به داشتن ستون های یکسان ندارند. این امر ذخیره و جستجوی داده های نیمه ساختاریافته و بدون ساختار را بسیار آسان می کند. MongoDB همچنین به صورت افقی مقیاس پذیر است، به این معنی که می توان آن را به راحتی با افزودن سرورهای بیشتر مقیاس پذیر کرد. این باعث می شود برای برنامه هایی که نیاز به مدیریت حجم زیادی از داده ها دارند، گزینه خوبی باشد."

        
    },
    "toast" : {
        "title" : "درخواست با موفقیت ارسال شد"
    },
    "education" :{
        "title" : "تحصیلات",
        "study" : "نقشه کشی معماری",
        "uni" : "دانشکده فنی و حرفه ای شهید چمران کرمان",
        "desc" : "معماری هنر و علم طراحی و ساخت ساختمان ها و سایر سازه های فیزیکی است. این شامل فرآیند خلاقانه برنامه ریزی، طراحی و ساخت فضاهایی است که عملکردی، زیبایی شناختی و پایدار هستند. معماران از دانش مهندسی، اصول طراحی و تجربیات عملی خود برای ایجاد فضاهایی که نیازهای افراد و جامعه را برآورده می کند استفاده می کنند. آنها برای ایجاد ساختارهایی که از نظر بصری جذاب و کاربردی هستند، عوامل مختلفی مانند مکان، مواد، تأثیرات محیطی و بافت فرهنگی را در نظر می گیرند. معماری نقش مهمی در شکل دادن به محیط ساخته شده ایفا می کند و تأثیر قابل توجهی بر نحوه زندگی، کار و تعامل مردم با محیط اطراف خود دارد.        "
    },
    "menu" : {
        "home" : "صفحه اصلی",
        "works" : "نمونه کارها",
        "contact" : "ارتباط با من",
        "about" : "درباره من",
        "credential" : "مهارت ها"
    },
    "form" : {
        "name" : "نام*",
        "email" : "ایمیل*",
        "sub" : "موضوع*",
        "desc" : "پیام شما*",
        "send" : "ارسال پیام"
    },
    "resume" : {
     "resume" : "دانلود رزومه"
    },
    "LETS" :{
     "one" : "بیا",
     "two" : "باهم ",
     "three" : "کار کنیم"
    },
    "footer" :{
        "name" : "امیرمحمد زنگی آبادی" ,
        "title" : "تمام حقوق مادی  و معنوی این سایت مربوط به "
    }
 
}